app/views/links/index.html.erb

          <%= link_to(link.title.titleize, link.url) %></br>
          score: <%= link.score%> comments: <%= link_to(link.num_comments, link.permalink)%> time: <%=time_ago_in_words(Time.at(link.created))%> ago
---
INSERT INTO "links" ("url", "title", "score", "permalink", "created", "num_comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

<%= javascript_include_tag "//www.google.com/jsapi", "chartkick" %>
<%= line_chart User.group_by_day(:created_at).count %>
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1