app/views/links/index.html.erb

<%= javascript_include_tag "http://code.highcharts.com/highcharts.js", "chartkick" %>
<%= pie_chart Link.group(:subreddit).count %>
---
SELECT "links".* FROM "links"