app/controllers/links_controller.rb

  def index

    Link.destroy_all
    client = RedditKit::Client.new 'myrailsproject99', 'myrailsproject99!!'

rr = client.search("artificial intelligence", {:time => :month, :limit => 100})
rr.results.sort_by {|el| el.num_comments }.reverse.each do |thread|
  link = Link.new
  link.url = thread.url
  link.title = thread.title
  link.user = User.all.first
  link.score = thread.score
  link.permalink = thread.permalink
  link.created = thread.attributes[:created_utc]
---
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "links".* FROM "links"
INSERT INTO "links" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-04-05 18:06:48.940949"], ["updated_at", "2015-04-05 18:06:48.940949"]]

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "thetitle"], ["url", "reddit.com "], ["user_id", 1], ["created_at", "2015-04-03 21:56:18.302638"], ["updated_at", "2015-04-03 21:56:18.302638"]]

    def set_link
      @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 2]]